/**
*@file GameClear.h
*@brief ゲームクリア画面のヘッダーファイル
*@author Kanazawa yuma
*@details ゲームクリア画面の実装
*/
#pragma once
#include "stdafx.h"

namespace basecross {
//--------------------------------------------------------------------------------------
///	ゲームクリアスプライト
//--------------------------------------------------------------------------------------
	class GameClearSprite : public GameObject {
	private:
		bool m_Trace;
		Vec3 m_StartScale;
		Vec3 m_StartPos;
		wstring m_TextureKey;

	public:

		//--------------------------------------------------------------------------------------
		/*!
		@brief　コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		GameClearSprite(const shared_ptr<Stage>& StagePtr, const wstring& TextureKey, bool Trace,
			const Vec3& StartScale, const Vec3& StartPos);

		//--------------------------------------------------------------------------------------
		/*!
		@brief　デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~GameClearSprite();

		//--------------------------------------------------------------------------------------
		/*!
		@brief　初期化
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override;

		//--------------------------------------------------------------------------------------
		/*!
		@brief　更新
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnUpdate()override {}
	};

}
//end basecross

