/*!
@file GameStageManager.h
@brief ゲームステージ時間マネージャー
*@author isii kaito
*/

#pragma once
#include "stdafx.h"
#include "GameManagerState.h"
namespace basecross {

	//--------------------------------------------------------------------------------------
	//	ゲームステージクラス
	//--------------------------------------------------------------------------------------
	class GameManager{

	public:

		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		*/
		GameManager()
		{
			
		}

		//--------------------------------------------------------------------------------------
		/*!
		@brief	インスタンスの取得
		*/
		static GameManager* Instance();
		

		//--------------------------------------------------------------------------------------
		/*!
		@brief	ステートの変更
		@引数	クラスに対応したステート
		*/
		void GetStage();

		//--------------------------------------------------------------------------------------
		/*!
		@brief	ステージ時間の取得
		@retrun	時間を返す
		*/
		static float GetElpasedTiem() ;

		//--------------------------------------------------------------------------------------
		/*!
		@brief	変身する時間の取得
		@retrun	時間を返す
		*/
		static float GetDayTiem();
	};
}
//end basecross


